# vim: ft=ruby
tap "homebrew/core"
tap "homebrew/bundle"

tap "derailed/k9s"
tap "hashicorp/tap"
tap "kubeshark/kubeshark"

brew "age"
brew "asdf"
brew "awscli"
brew "bat"
brew "bottom"
brew "cdktf"
brew "charm"
brew "charmcraft"
brew "charm-tools"
brew "chezmoi"
brew "dive"
brew "duf"
brew "dust"
brew "earthly"
brew "efm-langserver"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-extras"
brew "gitui"
brew "glab"
brew "golangci-lint"
brew "hadolint"
brew "helm"
brew "ipcalc"
brew "jq"
brew "juju"
brew "just"
brew "k6"
brew "derailed/k9s/k9s"
brew "kubeshark"
brew "ldns"
brew "lnav"
brew "lua-language-server"
brew "miller"
brew "mongosh"
brew "nushell"
brew "openapi-generator"
brew "prettyping"
brew "procs"
brew "qpdf"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "sk"
brew "sops"
brew "terraform"
brew "terraform-docs"
brew "terraform-ls"
brew "tflint"
brew "tfsec"
brew "typst"
brew "weechat"
brew "xh"
brew "yq"
brew "zoxide"

{{ if .machine.macos -}}
# macOS-specific
tap "homebrew/cask"
tap "homebrew/services"

brew "bash"
brew "colima"
brew "coreutils"
brew "curl"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "ghostscript"
brew "git"
brew "gnupg"
brew "htop"
brew "less"
brew "libqalculate"
brew "mas"
brew "moreutils"
brew "ncdu"
brew "neovim"
brew "pinentry-mac"
brew "postgresql@14"
brew "rename"
brew "tmux"
brew "universal-ctags"
brew "watch"
brew "zsh"

cask "alacritty"
cask "basictex"
cask "bitwarden"
cask "discord"
cask "eloston-chromium"
cask "emacs"
cask "firefox"
cask "flameshot"
cask "google-cloud-sdk"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "languagetool"
cask "notion"
cask "powershell"
cask "vscodium"

{{    if .machine.work -}}
tap "coursier/formulas"

brew "coursier"
brew "librdkafka"
brew "openjdk" # Required by coursier

cask "amazon-chime"
cask "citrix-workspace"
cask "figma"
cask "google-drive"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "perimeter81"
cask "postman"
cask "quip"
cask "redisinsight"
cask "slack"
{{    end -}}
{{ end -}}
