# vim: ft=ruby.chezmoitmpl
tap 'homebrew/bundle'

tap 'cue-lang/tap'
tap 'pulumi/tap'
tap 'stefanprodan/tap'

brew 'chezmoi'
brew 'cloudflared'
brew 'cue-lang/tap/cue'
brew 'd2'
brew 'duf'
brew 'dust'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git-extras'
brew 'grizzly'
brew 'gum'
brew 'hadolint'
brew 'helm'
brew 'helmfile'
brew 'jj'
brew 'jq'
brew 'kind'
brew 'luarocks'
brew 'mise'
brew 'mongosh'
brew 'openapi-generator'
brew 'operator-sdk'
brew 'pulumi/tap/pulumi'
brew 'qpdf'
brew 'ripgrep'
brew 'sad'
brew 'sk'
brew 'starship'
brew 'tea'
brew 'terraform'
brew 'terraform-docs'
brew 'tfsec'
brew 'stefanprodan/tap/timoni'
brew 'typst'
brew 'weechat'
brew 'xh'
brew 'zoxide'

{{ if not .machine.macos -}}
tap 'derailed/k9s'

brew 'age'
brew 'bat'
brew 'crane'
brew 'difftastic'
brew 'dive'
brew 'earthly'
brew 'gitui'
brew 'ipcalc'
brew 'just'
brew 'derailed/k9s/k9s'
brew 'kubeshark'
brew 'lnav'
brew 'miller'
brew 'prettyping'
brew 'sops'
brew 'watchexec'
brew 'yq'
{{ end -}}

{{ if .machine.macos -}}
tap "homebrew/cask-fonts"

brew 'bash'
brew 'cmake'
brew 'colima'
brew 'coreutils'
brew 'curl'
brew 'docker'
brew 'docker-buildx'
brew 'docker-compose'
brew 'doctl'
brew 'duckdb'
brew 'ghostscript'
brew 'git'
brew 'gnu-tar'
brew 'gnupg'
brew 'mas'
brew 'minikube'
brew 'moreutils'
brew 'ncdu'
brew 'neovim'
brew 'pinentry-mac'
brew 'postgresql@15'
brew 'rename'
brew 'tcptraceroute'
brew 'tmux'
brew 'watch'
brew 'watchman'
brew 'yara'
brew 'zellij'
brew 'zsh'

cask 'alacritty'
cask 'arc'
cask 'betterdisplay'
cask 'discord@canary'
cask 'eloston-chromium'
cask 'firefox@nightly'
cask 'font-victor-mono'
cask 'font-victor-mono-nerd-font'
cask 'ghostty'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
cask 'keycastr'
cask 'languagetool'
cask 'maccy'
cask 'middleclick', args: { no_quarantine: true }
cask 'nomachine'
cask 'notion'
cask 'notion-calendar'
cask 'thunderbird@daily'
cask 'utm'
cask 'visual-studio-code'
cask 'zen-browser'

{{    if .machine.work -}}
brew 'azure-cli'
brew 'coursier'
brew 'librdkafka'
brew 'openjdk'  # Required by coursier

cask 'figma'
cask 'google-drive'
cask 'microsoft-remote-desktop'
cask 'mongodb-compass-isolated-edition'
cask 'perimeter81'
cask 'pgadmin4'
cask 'postman'
cask 'redis-insight'
cask 'slack'
cask 'wireshark'
{{    end -}}
{{ end -}}
