# vim: ft=ruby.chezmoitmpl
tap 'cue-lang/tap'
tap 'derailed/k9s'
tap 'hashicorp/tap'
tap 'stefanprodan/tap'

brew 'bat'
brew 'chezmoi'
brew 'cloudflared'
brew 'cue-lang/tap/cue'
brew 'd2'
brew 'difftastic'
brew 'duf'
brew 'dust'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git-extras'
brew 'glab'
brew 'grizzly'
brew 'gum'
brew 'hadolint'
brew 'helm'
brew 'helm@3'
brew 'helmfile'
brew 'jj'
brew 'jjui'
brew 'jq'
brew 'derailed/k9s/k9s'
brew 'kind'
brew 'luarocks'
brew 'mise'
brew 'mongosh'
brew 'openapi-generator'
brew 'operator-sdk'
brew 'qpdf'
brew 'ripgrep'
brew 'sad'
brew 'sk'
brew 'sqruff'
brew 'starship'
brew 'tea'
brew 'hashicorp/tap/terraform'
brew 'terraform-docs'
brew 'tfsec'
brew 'stefanprodan/tap/timoni'
brew 'tree-sitter-cli'
brew 'typst'
brew 'watchexec'
brew 'weechat'
brew 'xh'
brew 'zoxide'

{{ if not .machine.macos -}}
brew 'age'
brew 'crane'
brew 'dive'
brew 'earthly'
brew 'gitui'
brew 'ipcalc'
brew 'just'
brew 'kubeshark'
brew 'lnav'
brew 'miller'
brew 'prettyping'
brew 'sops'
brew 'yq'

flatpak 'com.discordapp.Discord'                           # Discord
flatpak 'com.dropbox.Client'                               # Dropbox
flatpak 'net.lutris.Lutris'                                # Lutris
flatpak 'org.prismlauncher.PrismLauncher'                  # Prism Launcher
flatpak 'com.slack.Slack'                                  # Slack
flatpak 'com.valvesoftware.Steam'                          # Steam
flatpak 'org.mozilla.Thunderbird'                          # Thunderbird
flatpak 'io.github.ungoogled_software.ungoogled_chromium'  # Ungoogled Chromium
{{ end -}}

{{ if .machine.macos -}}
tap 'FelixKratz/formulae'
tap 'nikitabobko/tap'
tap 'slp/krunkit'

brew 'bash'
brew 'cmake'
brew 'colima'
brew 'coreutils'
brew 'curl'
brew 'docker'
brew 'docker-buildx'
brew 'docker-compose'
brew 'doctl'
brew 'duckdb'
brew 'ffmpeg'
brew 'ghostscript'
brew 'git'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnupg'
brew 'graphviz'
brew 'htop'
brew 'slp/krunkit/krunkit'
brew 'mas'
brew 'moreutils'
brew 'mtr'
brew 'ncdu'
brew 'neovim'
brew 'pinentry-mac'
brew 'postgresql@15'
brew 'rename'
brew 'FelixKratz/formulae/sketchybar'
brew 'tcptraceroute'
brew 'tmux'
brew 'watch'
brew 'watchman'
brew 'yara'
brew 'zellij'
brew 'zsh'

cask 'nikitabobko/tap/aerospace', args: { no_quarantine: true }
cask 'alacritty'
cask 'arc'
cask 'betterdisplay'
cask 'cap'
cask 'discord'
cask 'firefox@nightly'
cask 'flameshot'
cask 'font-sketchybar-app-font'
cask 'font-victor-mono'
cask 'font-victor-mono-nerd-font'
cask 'ghostty'
cask 'gimp'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
cask 'languagetool-desktop'
cask 'middleclick', args: { no_quarantine: true }
cask 'nomachine'
cask 'notion'
cask 'notion-calendar'
cask 'raycast'
cask 'thunderbird@daily'
cask 'ungoogled-chromium'
cask 'utm'
cask 'visual-studio-code'
cask 'zed'
cask 'zen'

{{    if .machine.work -}}
brew 'argocd'
brew 'azure-cli'
brew 'coursier'
brew 'librdkafka'
brew 'linode-cli'
brew 'openjdk'  # Required by coursier

cask 'chatgpt'
cask 'claude'
cask 'claude-code'
cask 'cursor'
cask 'gcloud-cli'
cask 'google-drive'
cask 'granola'
cask 'postman'
cask 'redis-insight'
cask 'slack'
cask 'wireshark-app'
{{    end -}}
{{ end -}}
